clear;
clc;
format long g; %输出结果为小数
%设定已知量数值
v=3850;

x(1)=0; y(1)=0;  z(1)=0; t(1)=0;
x(2)=-3431; y(2)=3040;  z(2)=9; t(2)=-0.3261;
x(3)=-2078; y(3)=1702; z(3)=9; t(3)=-0.3982;
x(4)=-1566; y(4)=779; z(4)=2; t(4)=-0.2657;
x(5)=-100; y(5)=717; z(5)=21; t(5)=-0.0087;


% syms xx yy zz tt %设定未知量
D=[x(2),y(2),z(2),-v^2*t(2); x(3),y(3),z(3),-v^2*t(3); x(4),y(4),z(4),-v^2*t(4);x(5),y(5),z(5),-v^2*t(5)];

dett=det(D); %求D的行列式；
if (dett==0)
    disp('行列式为0');
    return
end
% for i=1:3
%     bb=0.5*(x(i)^2 + y(i)^2 + z(i)^2 - t(i)^2) + t(i)*tt ;   %  求出b的代数式
%     if i==1
%         b1=bb;
%     elseif i==2
%         b2=bb;
%     else
%         b3=bb;
%     end
% end
bb1=0.5*(x(2)^2 + y(2)^2 + z(2)^2 - v^2*t(2)^2);   %  求出b的代数式
bb2=0.5*(x(3)^2 + y(3)^2 + z(3)^2 - v^2*t(3)^2);   %  求出b的代数式
bb3=0.5*(x(4)^2 + y(4)^2 + z(4)^2 - v^2*t(4)^2);   %  求出b的代数式
bb4=0.5*(x(5)^2 + y(5)^2 + z(5)^2 - v^2*t(5)^2);   %  求出b的代数式

D1=[bb1,y(2),z(2),-v^2*(t(2)^2);bb2,y(3),z(3),-v^2*(t(3)^2);bb3,y(4),z(4),-v*(t(4)^2);bb4,y(5),z(5),-v^2*(t(5)^2)];

D2=[x(2),bb1,z(2),-v^2*(t(2)^2);x(3),bb2,z(3),-v^2*(t(3)^2);x(4),bb3,z(4),-v*(t(4)^2);x(5),bb4,z(5),-v^2*(t(5)^2)];

D3=[x(2),y(2),bb1,-v^2*(t(2)^2);x(3),y(3),bb2,-v^2*(t(3)^2);x(4),y(4),bb3,-v*(t(4)^2);x(5),y(5),bb4,-v^2*(t(5)^2)];

D4=[x(2),y(2),z(2),bb1;x(3),y(3),z(3),bb2;x(4),y(4),z(4),bb3;x(5),y(5),z(5),bb4];

xx=det(D1)/det(D);
yy=det(D2)/det(D);
zz=det(D3)/det(D);
tt=det(D4)/det(D);
fprintf('%f\n',xx);
fprintf('%f\n',yy);
fprintf('%f\n',zz);
fprintf('%f\n',tt);


% jf = xx^2 + yy^2 + zz^2 - tt^2;
%  jf=char(jf);%将jf的代数式转化为字符串的形式，以便下行程序写成等式形式进行方程求解
% dengshi1=strcat(jf,'=0');   %连接字符串的函数，得到jf=0的形式
% tt1=solve(dengshi1,'tt');   %求解参数tt
% tt=tt1(1) ;  %得到的tt1有两个解取其中一个解
% xx1=subs(xx,'tt',tt) ; %将xx代数式中的tt参数值以tt数值代替，得到xx的数值xx1，下同
% yy1=subs(yy,'tt',tt) ;
% zz1=subs(zz,'tt',tt) ;
% vpa(tt/3850,5) %保留5位有效小数
% vpa(xx1,5)
% vpa(yy1,5)
% vpa(zz1,5)