
% result=[4597114.64236405,41518381.5028485,-2253.49611184519];
% 
% for i=1:5
%     rr(i)=((sample(i,1)-result(1))^2+(sample(i,2)-result(2))^2+(sample(i,3)-result(3))^2)^0.5/3850-sample(i,4);
% end
clc;
clear all;
sample=[
     41517290.037,4599537.326,24.565,0; %大鹏R2
     41519304.125,4595913.485,23.921,0.08;%工业广场Z1  7.11—8
     41519926.476,4597275.978,20.705,0.08999 %火药库Y6
     41520207.356,4597983.404,22.661,0.099999;%北青堆子W4
     41518060.298,4594304.927,21.926,0.23;%树碑子U3
     
%      41520815.875,4597384.576,25.468,2.73;%矿上车队X5
     
];
[x,y,z,t]=PSO(sample,3850);
% figure
% load seamount
% s = sqrt(-z/2);
% c = z;
% subplot(211);
% scatter(sample(:,1),sample(:,2),s,s)
% zoom(2)
% subplot(212);
% scatter(x,y,s,s)
% zoom(2)